app/controllers/tasks_controller.rb

SELECT  "tasks".* FROM "tasks"   ORDER BY "tasks"."id" DESC LIMIT 1
---
  def index
    @tasks = Task.all

INSERT INTO "tasks" ("created_at", "description", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-11-24 20:30:52.186628"], ["description", "test task"], ["updated_at", "2014-11-24 20:30:52.186628"]]
---
  def create
    @task = Task.new(task_params)
    if @task.save